app/models/shortened_url.rb

  def self.random_code
    random = SecureRandom.urlsafe_base64
    random = SecureRandom.urlsafe_base64 until !ShortenedUrl.exists?(short_url: "#{random}")
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "jHKHFejDRnh9rArPglDSlw"], ["LIMIT", 1]]

  def no_spamming
    num_submitted = submitter.submitted_urls.count { |url| Time.new - url.created_at < 60 }
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.choi.com"], ["short_url", "jHKHFejDRnh9rArPglDSlw"], ["user_id", 1], ["created_at", "2019-06-26 22:05:06.277812"], ["updated_at", "2019-06-26 22:05:06.277812"]]

  def self.prune(minute)
    seconds = minute * 60


    ShortenedUrl.all.each do |url|
---
SELECT "shortened_urls".* FROM "shortened_urls"