app/models/visit.rb

INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["shortened_url_id", 1], ["created_at", "2019-06-26 23:07:05.308398"], ["updated_at", "2019-06-26 23:07:05.308398"]]
---
  def Visit.record_visit!(user,shortened_url)
    visitor_id = user.id
    shortened_url_id = shortened_url.id
    Visit.create!(user_id: visitor_id, shortened_url_id: shortened_url_id)